ЛИС2/src/Catalogs/ВодныеОбъекты/ВодныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВодныеОбъекты</name>
  <comment>В справочнике содержатся сведения о водных объектах.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВХУ</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВодногоОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВодногоОбъекта</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаПоДаннымГВР</name>
    <type>
      <types>EnumRef.ТипыВодныхОбъектовПоДаннымГВР</types>
    </type>
  </attributes>
  <attributes>
    <name>ОхраннаяЗона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодосборнаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаРеки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстьяДоВпадения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьВодоема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаВодотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БассейновыйОкруг</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТомаПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыпускПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияВО</name>
    <type>
      <types>EnumRef.КлассификацияВодныхОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/ВидыВодногоОбъекта/ВидыВодногоОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВодногоОбъекта</name>
  <enumValues>
    <name>Море10</name>
  </enumValues>
  <enumValues>
    <name>Река20</name>
  </enumValues>
  <enumValues>
    <name>РекаПересыхающая21</name>
  </enumValues>
  <enumValues>
    <name>Озеро30</name>
  </enumValues>
  <enumValues>
    <name>ВодохранилищеРусловое40</name>
  </enumValues>
  <enumValues>
    <name>ВодохранилищеНаливное41</name>
  </enumValues>
  <enumValues>
    <name>Канал50</name>
  </enumValues>
  <enumValues>
    <name>Подземный60</name>
  </enumValues>
  <enumValues>
    <name>Шахта61</name>
  </enumValues>
  <enumValues>
    <name>Скважина62</name>
  </enumValues>
  <enumValues>
    <name>Коллектор71</name>
  </enumValues>
  <enumValues>
    <name>СетьКанализации91</name>
  </enumValues>
  <enumValues>
    <name>ЛивневойКоллектор99</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Enums/ТипыВодныхОбъектовПоДаннымГВР/ТипыВодныхОбъектовПоДаннымГВР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВодныхОбъектовПоДаннымГВР</name>
  <enumValues>
    <name>Озеро</name>
  </enumValues>
  <enumValues>
    <name>Река</name>
  </enumValues>
  <enumValues>
    <name>ПодземныйВодныйОбъект</name>
  </enumValues>
  <enumValues>
    <name>Водоток</name>
  </enumValues>
  <enumValues>
    <name>Ручьи</name>
  </enumValues>
  <enumValues>
    <name>Пруд</name>
  </enumValues>
  <enumValues>
    <name>Водохранилище</name>
  </enumValues>
  <enumValues>
    <name>Канал</name>
  </enumValues>
  <enumValues>
    <name>Залив</name>
  </enumValues>
  <enumValues>
    <name>Разлив</name>
  </enumValues>
  <enumValues>
    <name>Пролив</name>
  </enumValues>
  <enumValues>
    <name>Лиман</name>
  </enumValues>
  <enumValues>
    <name>Родники</name>
  </enumValues>
  <enumValues>
    <name>Сор</name>
  </enumValues>
  <enumValues>
    <name>Лагуна</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Enums/КлассификацияВодныхОбъектов/КлассификацияВодныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассификацияВодныхОбъектов</name>
  <enumValues>
    <name>Водоем</name>
  </enumValues>
  <enumValues>
    <name>Водоток</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Enums/ТипыВоднойКлассификации/ТипыВоднойКлассификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВоднойКлассификации</name>
  <enumValues>
    <name>БассейновыйОкруг</name>
  </enumValues>
  <enumValues>
    <name>РечнойБассейн</name>
  </enumValues>
  <enumValues>
    <name>РечнойПодбассейн</name>
  </enumValues>
  <enumValues>
    <name>ВХУ</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/ВодныеОбъекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация	

	ВидОбъектаРека = Перечисления.ВидыВодногоОбъекта.Река20;
	УправлениеВидимостью(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ВХУ) И Не ЗначениеЗаполнено(Объект.БассейновыйОкруг) Тогда
		Объект.БассейновыйОкруг = ПолучитьБассейновыйОкругНаСервере(Объект.ВХУ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидВодногоОбъектаПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КлассификацияВОПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка контактной информации.

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеОчистка(ЭтотОбъект, Элемент.Имя);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтотОбъект, Команда.Имя);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтотОбъект, Результат);
КонецПроцедуры

&НаСервере
Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	Форма.Элементы.ГруппаХарактеристикиРеки.Видимость = ( Форма.Объект.ТипОбъектаПоДаннымГВР = ПредопределенноеЗначение( "Перечисление.ТипыВодныхОбъектовПоДаннымГВР.Река" ) );	// Форма.Объект.ВидВодногоОбъекта = Форма.ВидОбъектаРека

	Если НЕ Форма.Элементы.ГруппаХарактеристикиРеки.Видимость Тогда
		Форма.Объект.РасстояниеОтУстьяДоВпадения = 0;
		Форма.Объект.ШиринаРеки = 0;
	КонецЕсли;
	
	Если Форма.Объект.КлассификацияВО = ПредопределенноеЗначение( "Перечисление.КлассификацияВодныхОбъектов.Водоток" ) Тогда
		Форма.Элементы.ДлинаВодотока.Видимость = Истина;
		Форма.Элементы.ПлощадьВодоема.Видимость = Ложь;
	ИначеЕсли Форма.Объект.КлассификацияВО = ПредопределенноеЗначение( "Перечисление.КлассификацияВодныхОбъектов.Водоем" ) Тогда
		Форма.Элементы.ДлинаВодотока.Видимость = Ложь;
		Форма.Элементы.ПлощадьВодоема.Видимость = Истина;
	Иначе
		Форма.Элементы.ДлинаВодотока.Видимость = Ложь;
		Форма.Элементы.ПлощадьВодоема.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВХУПриИзменении(Элемент)
	
	Объект.БассейновыйОкруг = ПолучитьБассейновыйОкругНаСервере(Объект.ВХУ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБассейновыйОкругНаСервере(ВодохозяйственныйУчасток)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВодохозяйственныеУчастки.Ссылка						 КАК Ссылка,
	|	ВодохозяйственныеУчастки.ТипВоднойКлассификации		 КАК ТипВоднойКлассификации
	|ИЗ
	|	Справочник.ВодохозяйственныеУчастки КАК ВодохозяйственныеУчастки
	|ГДЕ
	|	ВодохозяйственныеУчастки.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", ВодохозяйственныйУчасток);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	БассейновыйОкруг = ?(Выборка.ТипВоднойКлассификации = Перечисления.ТипыВоднойКлассификации.БассейновыйОкруг, Выборка.Ссылка, "");
	
	Возврат БассейновыйОкруг;
	
КонецФункции

#КонецОбласти
